Práctica: Medidas descriptivas con Pandas

In [ ]:
# Se puede ejecutar código al sistema operativo desde python con el caracter "!"
!dir

In [4]:
import pandas as pd
url = 'http://manage.humdata.org/hdx/api/exporter/indicator/csv/TT014/source/mdgs/fromYear/1950/toYear/0/language/en/TT014_Baseline.csv'

In [5]:
from_url = pd.read_table(url,sep=",")

In [6]:
from_url.head()

Empty DataFrame
Columns: [Something has gone wrong. We apologise for the inconvenience. We have logged this issue and are investigating a fix.]
Index: []

In [ ]:
from_url.info()

In [4]:
some_cols=pd.read_table(url,sep=',',usecols=[1,2,3,4,5,6,7])

In [5]:
some_cols.head()

           Country name  2015  2014  2013  2012  2011  2010
0           AFGHANISTAN  27.7  27.7  27.7  27.7  27.7  27.3
1                ANGOLA  36.8  36.8  34.1  38.2  38.6  38.6
2               ALBANIA  20.7  20.0  15.7  15.7  16.4  16.4
3               ANDORRA  50.0  50.0  50.0  50.0  35.7  35.7
4  UNITED ARAB EMIRATES  17.5  17.5  17.5  17.5  22.5  22.5

In [6]:
#el max y mínimo se toma de todo el conjunto de datos
some_cols.describe()

             2015        2014        2013        2012        2011        2010
count  189.000000  189.000000  190.000000  189.000000  187.000000  187.000000
mean    20.403704   20.137566   19.037895   18.189947   17.532086   17.381283
std     12.072191   11.908959   11.393488   11.420165   11.094338   11.140854
min      0.000000    0.000000    0.000000    0.000000    0.000000    0.000000
25%     12.000000   11.000000   10.700000   10.000000    9.800000    9.000000
50%     19.300000   18.800000   17.350000   16.800000   15.600000   15.600000
75%     27.400000   26.600000   24.925000   24.400000   23.500000   23.500000
max     63.800000   63.800000   56.300000   56.300000   56.300000   56.300000

<count:> esta es la cantidad de valores incluidos en las estadísticas.

<mean:> este es el promedio de los valores.

<std:> esta es la desviación estándar de la distribución.

<min:> este es el valor más bajo de la distribución.

25%: este es el valor del primer cuartil. El 25 % de los valores se encuentran en o por debajo de este valor.

50%: este es el valor para el segundo cuartil. El 50 % de los valores se encuentran en o por debajo de este valor. También es el valor de la mediana.

75%: este es el valor para el tercer cuartil. El 75 % de los valores se encuentran en o por debajo de este valor.

<max:> este es el valor más alto de la distribución.

In [ ]:
correl = some_cols.corr()
correl

In [ ]:
#!pip install seaborn

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt
sns.heatmap(correl)
plt.savefig('attribute_correlations.png', tight_layout=True)